{
    "0":{
        "id":0,
        "type":"UE",
        "nom":"UE",
        "title":"UE",
        "color":"#000000",
        "nomMemu":["Réaliser", "Optimiser", "Administrer", "Gérer", "Conduire", "Collaborer"],
        "icon":[],
        "profile":"",
        "text":{
            "main":[
                "L'UE 1, Développer une application, cette unité d'enseignement vise à fournir aux étudiants les compétences et les connaissances nécessaires pour développer des applications logicielles à partir de zéro, en mettant l'accent sur les principes de base du développement de logiciels et en utilisant souvent des langages de programmation et des technologies populaires. Elle est une des plus importantes et est presque associés à tous mes projets se trouvant sur le site.",
                "L'UE 2, Optimiser une application, Proposer des applications informatiques optimisées en fonction de critères spécifiques : temps d’exécution, précision, consommation de ressources..",
                "L'UE 3, Administrer, Installer, configurer, mettre à disposition, maintenir en conditions opérationnelles des infrastructures, des services et des réseaux et optimiser le système informatique d’une organisation",
                "UE 4, Gérer une base de donnée, Concevoir, gérer, administrer et exploiter les données de l’entreprise et mettre à disposition toutes les informations pour un bon pilotage de l’entreprise",
                "UE 5, Conduire un projet, Satisfaire les besoins des utilisateurs au regard de la chaîne de valeur du client, organiser et piloter un projet informatique avec des méthodes classiques ou agiles",
                "UE 6, Collaborer, Acquérir, développer et exploiter les aptitudes nécessaires pour travailler efficacement dans une équipe informatique"
            ],
            "bonus":{
                "titleB":"SAE lié",
                "textB":["Daily Info, Keb'App, Aide à la décision","Création d'un algo de tri (S1), Daily Info, Aide à la décision","SAE Guide d'installation d'un poste de travail, SAE Installation et utilisation de Linux","Daily Info, SAE PowerBI, SAE Gestion BD","Rédaction de cahier des charges pour tous les projets","Poster, Campagne Fictive pour Auvergnat Cola"]
            }
        }
    },
    "1":{
        "id":1,
        "type":"Langages",
        "nom":"Langages",
        "title":"Langages",
        "nomMemu":["Python", "C", "Java", "AndroidStudio / Kotlin", "JS", "VueJS", "HTML / CSS", "PHP", "Symfony", "SQL", "PowerBI", "MongoDB", "Docker", "GIT", "Jinja2"],
        "icon":[],
        "profile":"",
        "text":{
            "main":[
                "Python est un langage de programmation polyvalent, reconnu pour sa simplicité syntaxique et sa lisibilité. Il est largement utilisé dans le développement web, le machine learning, l'automatisation de tâches et bien plus encore.",
                "Le langage C est un pilier de la programmation informatique, réputé pour son efficacité et sa proximité avec le matériel. Il est souvent utilisé dans le développement de systèmes d'exploitation, de logiciels embarqués et d'applications nécessitant des performances optimales.",
                "Java est un langage de programmation populaire, reconnu pour sa portabilité et sa robustesse. Il est largement utilisé pour développer des applications d'entreprise, des applications Android, des systèmes distribués et bien d'autres projets.",                    
                "Kotlin est un langage moderne conçu pour interagir parfaitement avec Java, en particulier pour le développement d'applications Android. Android Studio est l'environnement de développement intégré (IDE) de prédilection pour créer des applications Android avec Kotlin, offrant des fonctionnalités avancées pour faciliter le développement.",                    
                "JavaScript est le langage de programmation essentiel pour le développement web. Il permet d'ajouter des fonctionnalités dynamiques et interactives aux sites web, de créer des applications web côté client, des jeux et bien plus encore.",                    
                "Vue.js est un framework JavaScript progressif et accessible, utilisé pour construire des interfaces utilisateur interactives et dynamiques. Il offre une architecture flexible et des performances optimales, ce qui en fait un choix populaire pour le développement d'applications web modernes.",                  
                "HTML et CSS sont les langages de base du développement web. HTML est utilisé pour structurer le contenu des pages web, tandis que CSS est utilisé pour styliser et mettre en forme ces contenus, créant ainsi des expériences visuelles attrayantes et cohérentes.",                    
                "PHP est un langage de script côté serveur largement utilisé pour le développement web. Il est principalement utilisé pour générer des contenus dynamiques, traiter les formulaires, interagir avec les bases de données et bien plus encore.",                    
                "Symfony est un framework PHP robuste et modulaire, utilisé pour accélérer le processus de développement d'applications web complexes. Il offre une architecture flexible, des composants réutilisables et une communauté active, ce qui en fait un choix populaire parmi les développeurs PHP.",                 
                "My SQL et SQLDeveloper. SQL (Structured Query Language) est un langage de programmation utilisé pour communiquer avec les bases de données relationnelles. Il permet de manipuler et de gérer les données stockées dans une base de données, en effectuant des opérations telles que la création, la modification et la récupération de données.",                    
                "Power BI est une plateforme d'analyse de données de Microsoft qui permet aux utilisateurs de visualiser et partager des insights à partir de données. Il offre des outils de création de rapports, de visualisation et de tableau de bord pour aider les entreprises à prendre des décisions informées.",                
                "MongoDB est une base de données NoSQL flexible et évolutive, utilisée pour stocker des données semi-structurées et non structurées. Elle offre une scalabilité horizontale, une haute disponibilité et une flexibilité de schéma, ce qui en fait un choix populaire pour les applications web modernes.",                    
                "Docker est une plateforme de virtualisation légère qui permet aux développeurs de créer, de déployer et d'exécuter des applications dans des conteneurs logiciels. Il offre une gestion efficace des environnements de développement et de production, ainsi qu'une portabilité des applications entre différents systèmes.",             
                "Git est un système de contrôle de version distribué largement utilisé pour le suivi des modifications apportées au code source lors du développement logiciel. Il permet aux équipes de collaborer efficacement, de gérer les branches de code et de suivre l'historique des modifications.",
                "Moteur de template HTML pour Python"
            ]
        }
    }
}
